; domain
;My intial and basic cargo transport Domain
;; actions load unload and fly was not implemented by me

(define (domain cargo-transport)

    (:requirements :strips :action-costs :fluents)

    (:predicates
        (In ?obj ?place)
        (At ?obj ?place)
        (Location ?place)
        (Cargo ?obj)
        (Plane ?obj)
        (Airport ?obj)
        (Truck ?obj)

    )

    ; (:functions
    ;     (total-cost) - number
    ; )
    (:action LOAD
        :parameters (?c ?p ?a)
        :precondition (and (At ?c ?a)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (At ?c ?a)) (In ?c ?p))
    )

    (:action UNLOAD
        :parameters (?c ?p ?a)
        :precondition (and (In ?c ?p)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (In ?c ?p)) (At ?c ?a))
    )

    (:action FLY
        :parameters (?p ?from ?to)
        :precondition (and (At ?p ?from)
            (Plane ?p)
            (Airport ?from)
            (Airport ?to))
        :effect (and
            (not (At ?p ?from))
            (At ?p ?to)
            ; (increase (total-cost) 5)
        )
    )
    (:action Drive
        :parameters (?t ?from ?to)
        :precondition (and(At ?t ?from)
            (Truck ?t)
            (Location ?from)
            (Location ?to))
        :effect (and
            (not (At ?t ?from))
            (At ?t ?to)
            ; (increase (total-cost) 5)
        )
    )
    ;; I am keeping the load and unload for planes and trucks seperate for now might concatinate them later (:action Pick-up
    (:action Pick-up
        :parameters (?c ?t ?l)
        :precondition (and (At ?c ?l)
            (At ?c ?l)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l)

        )
        :effect (and (not (At ?c ?l)) (In ?c ?t))
    )
    (:action drop
        :parameters (?c ?t ?l)
        :precondition (and (In ?c ?t)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l))
        :effect (and (not (In ?c ?t)) (At ?c ?l))
    )
)

; problem
(define (problem problem4)
    (:domain cargo-transport)
    (:objects
        cargo1 cargo2 cargo3 cargo4 cargo5 truck1 truck2 truck3 truck4 plane1 plane2 plane3 plane4 Manchester Birmingham London New-york Liverpool Edinburgh
    )

    (:init
        (Cargo cargo1)
        (Cargo cargo2)
        (Cargo cargo3)
        (Cargo cargo4)
        (Truck truck1)
        (Truck truck2)
        (Truck truck3)
        (Truck truck4)
        (Plane plane1)
        (Plane plane2)
        (Plane plane3)
        (Location Manchester)
        (Location Birmingham)
        (Location London)
        (Location Liverpool)
        (Location Edinburgh)
        (At cargo1 Manchester) ;boths cargo 1 and 2 are at Manchester
        (At cargo2 Manchester)
        (At plane1 Manchester)
        (At cargo3 London)
        (At cargo4 Birmingham)
        (At plane2 London)
        (At plane3 Liverpool)
        (At truck1 Edinburgh)

    )

    (:goal
        (and
            (At cargo1 Edinburgh) (At cargo2 London) (At cargo3 Liverpool) (At cargo4 Manchester)
        )
    )

)

; plan
1. (drive truck1 edinburgh manchester)
   deleted: (at truck1 edinburgh)
   added: (at truck1 manchester)
   goals met: 0 of 4
2. (pick-up cargo2 truck1 manchester)
   deleted: (at cargo2 manchester)
   added: (in cargo2 truck1)
   goals met: 0 of 4
3. (drive truck1 manchester birmingham)
   deleted: (at truck1 manchester)
   added: (at truck1 birmingham)
   goals met: 0 of 4
4. (drive truck1 birmingham london)
   deleted: (at truck1 birmingham)
   added: (at truck1 london)
   goals met: 0 of 4
5. (drop cargo2 truck1 london)
   deleted: (in cargo2 truck1)
   added: (at cargo2 london)
   goals met: 1 of 4
6. (drive truck1 london birmingham)
   deleted: (at truck1 london)
   added: (at truck1 birmingham)
   goals met: 1 of 4
7. (pick-up cargo4 truck1 birmingham)
   deleted: (at cargo4 birmingham)
   added: (in cargo4 truck1)
   goals met: 1 of 4
8. (drive truck1 birmingham manchester)
   deleted: (at truck1 birmingham)
   added: (at truck1 manchester)
   goals met: 1 of 4
9. (drop cargo4 truck1 manchester)
   deleted: (in cargo4 truck1)
   added: (at cargo4 manchester)
   goals met: 2 of 4
10. (drive truck1 manchester london)
   deleted: (at truck1 manchester)
   added: (at truck1 london)
   goals met: 2 of 4
11. (pick-up cargo3 truck1 london)
   deleted: (at cargo3 london)
   added: (in cargo3 truck1)
   goals met: 2 of 4
12. (drive truck1 london liverpool)
   deleted: (at truck1 london)
   added: (at truck1 liverpool)
   goals met: 2 of 4
13. (drop cargo3 truck1 liverpool)
   deleted: (in cargo3 truck1)
   added: (at cargo3 liverpool)
   goals met: 3 of 4
14. (drive truck1 liverpool manchester)
   deleted: (at truck1 liverpool)
   added: (at truck1 manchester)
   goals met: 3 of 4
15. (pick-up cargo1 truck1 manchester)
   deleted: (at cargo1 manchester)
   added: (in cargo1 truck1)
   goals met: 3 of 4
16. (drive truck1 manchester edinburgh)
   deleted: (at truck1 manchester)
   added: (at truck1 edinburgh)
   goals met: 3 of 4
17. (drop cargo1 truck1 edinburgh)
   deleted: (in cargo1 truck1)
   added: (at cargo1 edinburgh)
   goals met: 4 of 4
